Reports/ПредварительнаяСебестоимостьЗаказДоговора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>ПредварительнаяСебестоимостьЗаказДоговора</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументРозницы</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
						<v8:Type>cfg:DocumentRef.ПредварительныйРасчетЗаказДоговора</v8:Type>
						<v8:Type>cfg:DocumentRef.Лид</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПредварительногоРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиПредварительногоРасчетаЗаказаВРознице</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/ЦеныМатериаловПоставщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЦеныМатериаловПоставщиков</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаСФотопечатью</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦеныПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦенПоставщиков</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фактура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фактура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦветФактуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦветФактуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ВыработкаИсполнителейРозницы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ВыработкаИсполнителейРозницы</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДокументУСВ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
						<v8:Type>cfg:DocumentRef.УстановкаСтоимостиВыработкиПоНоменклатуре</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНачисления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНачислений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектВыработки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыпускПродукции</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.Лид</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УДАЛИТЬ_ДокументУстановкиЦены</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УстановкаЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЦеныПоставщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЦеныПоставщиков</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦеныПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦенПоставщиков</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыЗаказов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаказДоговор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаПроизводство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Монтаж</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ОприходованиеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ОприходованиеТоваров</Name>
			<Comment>Оприходование товаров</Comment>
			<BasedOn>
				<xr:Item>Document.Инвентаризация</xr:Item>
				<xr:Item>Document.ЗаказНаПроизводство</xr:Item>
				<xr:Item>Document.ВыпускПродукции</xr:Item>
				<xr:Item>Document.Монтаж</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ДоходыРасходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыпускПродукции</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДоходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданПриИспользованииПодразделений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДоходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/ПредварительнаяСебестоимостьЗаказДоговора/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.Дата = ТекущаяДатаСеанса();
	//#12333
	//Отчет.НастройкаПредварительногоРасчета = Константы.НастройкаПредварительногоРасчетаЗаказаВРозницеПоУмолчанию.Получить();
	Отчет.НастройкаПредварительногоРасчета = ПараметрыСеанса.ТекущийПользователь.НастройкаПредварительногоРасчетаЗаказаВРознице;
	Отчет.ДокументРозницы = Параметры.ЗаказДоговор;
	Если НЕ Отчет.ДокументРозницы = Неопределено Тогда
		Если НЕ Отчет.ДокументРозницы.Пустая() Тогда
			СформироватьПриОткрытии = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если СформироватьПриОткрытии Тогда
		Сформировать(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийКомандФормы

&НаКлиенте
Процедура Сформировать(Команда) Экспорт
	
	ОчиститьСообщения();
	Если НЕ ЗначениеЗаполнено(Отчет.ДокументРозницы) Тогда
		//++ №10184 переименовали поле
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан заказ-договор или лид", , "Отчет.ДокументРозницы");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан документ расчета", , "Отчет.ДокументРозницы");
		//-- №10184
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Отчет.НастройкаПредварительногоРасчета) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указана настройка", , "Отчет.НастройкаПредварительногоРасчета");
		Возврат;
	КонецЕсли;
	
	Результат = СформироватьНаСервере();
	
КонецПроцедуры

&НаСервере
Функция СформироватьНаСервере()
	
	//++ №14357 проверка на указание основного предварительного расчета
	ПредварительныйРасчет = Неопределено;
	
	Если ТипЗнч(Отчет.ДокументРозницы) = Тип("ДокументСсылка.Лид") Тогда
		
		Запрос = новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ПредварительныйРасчет.Ссылка = ПредварительныйРасчет.Основание.ОсновнойПредварительныйРасчет
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Основной,
		|	ПредварительныйРасчет.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПредварительныйРасчетЗаказДоговора КАК ПредварительныйРасчет
		|ГДЕ
		|	ПредварительныйРасчет.Основание = &Лид
		|	И НЕ &Лид = ЗНАЧЕНИЕ(Документ.Лид.ПустаяСсылка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Основной УБЫВ
		|";
		Запрос.УстановитьПараметр("Лид", Отчет.ДокументРозницы);
		
		Выборка = Запрос.Выполнить().Выбрать();
		ТекстСообщения = "";
		
		Если Выборка.Следующий() Тогда
			
			Если Выборка.Основной Или Выборка.Количество() = 1 Тогда
				
				ПредварительныйРасчет = Выборка.Ссылка;
				
			Иначе
				
				ТекстСообщения = "Невозможно определить предварительный расчет для формирования отчета.
				|Укажите какой предварительный расчет является основным в лиде.";
				
			КонецЕсли;
			
		Иначе
			
			ТекстСообщения = "У лида не обнаружено предварительных расчетов для формирования отчета.";
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТекстСообщения) Тогда
			
			Сообщить(ТекстСообщения);
			Возврат новый ТабличныйДокумент;
			
		КонецЕсли;
		
	КонецЕсли;
	//-- №14357
	
	ДатаОтчета = КонецДня(Отчет.Дата);
	
	ТаблицаТоваров = Новый ТаблицаЗначений;
	ТаблицаТоваров.Колонки.Добавить("Комната");
	ТаблицаТоваров.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаТоваров.Колонки.Добавить("ХарактеристикаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаТоваров.Колонки.Добавить("ЕдиницаИзмерения");
	ТаблицаТоваров.Колонки.Добавить("ЭтоМатериал", Новый ОписаниеТипов("булево"));
	ТаблицаТоваров.Колонки.Добавить("ЭтоПотолок", Новый ОписаниеТипов("булево"));
	ТаблицаТоваров.Колонки.Добавить("Количество", Новый ОписаниеТипов("число"));
	ТаблицаТоваров.Колонки.Добавить("Цена", Новый ОписаниеТипов("число"));
	ТаблицаТоваров.Колонки.Добавить("Сумма", Новый ОписаниеТипов("число"));
	ТаблицаТоваров.Колонки.Добавить("ЦенаСебестоимость", Новый ОписаниеТипов("число"));
	ТаблицаТоваров.Колонки.Добавить("СуммаСебестоимость", Новый ОписаниеТипов("число"));
	ТаблицаТоваров.Колонки.Добавить("Прибыль", Новый ОписаниеТипов("число"));
	ТаблицаТоваров.Колонки.Добавить("Рентабельность", Новый ОписаниеТипов("число"));
	
	ТаблицаСебестоимостиПотолков = Новый ТаблицаЗначений;
	ТаблицаСебестоимостиПотолков.Колонки.Добавить("Комната");
	ТаблицаСебестоимостиПотолков.Колонки.Добавить("ВидСебестоимости");
	ТаблицаСебестоимостиПотолков.Колонки.Добавить("Потолок");
	ТаблицаСебестоимостиПотолков.Колонки.Добавить("Номенклатура");
	ТаблицаСебестоимостиПотолков.Колонки.Добавить("Фактура");
	ТаблицаСебестоимостиПотолков.Колонки.Добавить("Цвет");
	ТаблицаСебестоимостиПотолков.Колонки.Добавить("ЕдиницаИзмерения");
	ТаблицаСебестоимостиПотолков.Колонки.Добавить("Количество", Новый ОписаниеТипов("число"));
	ТаблицаСебестоимостиПотолков.Колонки.Добавить("ЦенаСебестоимость", Новый ОписаниеТипов("число"));
	ТаблицаСебестоимостиПотолков.Колонки.Добавить("СуммаСебестоимость", Новый ОписаниеТипов("число"));
	
	//добавим товары
	//++ №10184 по лиду выведено в отдельный документ ПредварительныйРасчетЗаказДоговора
	Если ТипЗнч(Отчет.ДокументРозницы) = Тип("ДокументСсылка.Лид") Тогда
		ТоварыУслуги = ПредварительныйРасчет.ТоварыУслуги;
	Иначе
		ТоварыУслуги = Отчет.ДокументРозницы.ТоварыУслуги;
	КонецЕсли;
	//-- №10184
	
	Для Каждого СтрокаДоговора Из ТоварыУслуги Цикл
		Если НЕ СтрокаДоговора.Номенклатура.Пустая() Тогда
			НоваяСтрока = ТаблицаТоваров.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДоговора);
			НоваяСтрока.ЭтоМатериал = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	//добавим материалы
	//++ №10184 по лиду выведено в отдельный документ ПредварительныйРасчетЗаказДоговора
	Если ТипЗнч(Отчет.ДокументРозницы) = Тип("ДокументСсылка.Лид") Тогда
		Материалы = ПредварительныйРасчет.Материалы;
	Иначе
		Материалы = Отчет.ДокументРозницы.Материалы;
	КонецЕсли;
	//-- №10184
	
	Для Каждого СтрокаДоговора Из Материалы Цикл
		Если НЕ СтрокаДоговора.Номенклатура.Пустая() Тогда
			НоваяСтрока = ТаблицаТоваров.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДоговора);
			НоваяСтрока.ЭтоМатериал = Истина;
		КонецЕсли;
	КонецЦикла;
	
	ОрганизацияСебестоимости = Справочники.Организации.ПустаяСсылка();
	Если НЕ Константы.ОбщиеСклады.Получить() Тогда
		Если ТипЗнч(Отчет.ДокументРозницы) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
			ОрганизацияСебестоимости = Отчет.ДокументРозницы.Организация;
		Иначе
			
			//++ №10184
			Если ТипЗнч(Отчет.ДокументРозницы) = Тип("ДокументСсылка.Лид") Тогда
				
				ТочкаПродаж = Отчет.ДокументРозницы.ТочкаПродаж;
				Подразделение = Отчет.ДокументРозницы.Подразделение;
				
			Иначе
				
				ТочкаПродаж = Отчет.ДокументРозницы.Основание.ТочкаПродаж;
				Подразделение = Отчет.ДокументРозницы.Основание.Подразделение;
				
			КонецЕсли;
			//-- №10184
			
			НастройкаИнтеркампани = ОбщийМодуль.ПолучитьНастройкуИнтеркампани(ТочкаПродаж, Подразделение, Отчет.ДокументРозницы.Организация);
			ОрганизацияСебестоимости = НастройкаИнтеркампани.ОрганизацияРозничныеПродажи;
		КонецЕсли;
	КонецЕсли;
	
	// себестоимость потолков
	Если Отчет.НастройкаПредварительногоРасчета.ПотолкиЗакупаютсяУПоставщика Тогда
		//ПОКУПАЕМ У ПОСТАВЩИКА
		Для Каждого СтрокаТовара Из ТаблицаТоваров Цикл
			Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(СтрокаТовара.Номенклатура) Тогда
				СтрокаТовара.ЭтоПотолок = Истина;
				//потолок или отрез
				ОписаниеОшибки = "";
				СтруктураПотолок = ОбменСEasyCeiling.ПолучитьСтруктуруПотолка(СтрокаТовара.Номенклатура, Неопределено,,,,,, ОписаниеОшибки);
				Если СтруктураПотолок = Неопределено Тогда
					Продолжить;
				КонецЕсли;	
				Если ЗначениеЗаполнено(ОписаниеОшибки)
					И СтруктураПотолок.Свойство("ПродукцияНоменклатура") 
					И НЕ ЗначениеЗаполнено(СтруктураПотолок.ПродукцияНоменклатура) Тогда
					Продолжить;
				КонецЕсли;				
				СтруктураЗаказ = ОбменСEasyCeiling.ПолучитьСтруктуруЗаказаПоставщику(СтруктураПотолок, Отчет.НастройкаПредварительногоРасчета.Поставщик, Отчет.НастройкаПредварительногоРасчета.ВидЦеныПоставщика, Отчет.НастройкаПредварительногоРасчета.ВалютаЗаказа, ДатаОтчета);
				
				СуммаСебестоимостиПотолка = 0;
				
				//разобьем потолок - пленка
				Для Каждого СтрокаФактуры Из СтрокаТовара.Номенклатура.Потолок_Фактура Цикл
					НоваяСтрока = ТаблицаСебестоимостиПотолков.Добавить();
					НоваяСтрока.Комната = СтрокаТовара.Комната;
					НоваяСтрока.Потолок = СтрокаТовара.Номенклатура;
					НоваяСтрока.ВидСебестоимости = "Стоимость пленки по прайсу поставщика";
					НоваяСтрока.Номенклатура = СтрокаФактуры.ПродукцияЦвет.Номенклатура;
					НоваяСтрока.Фактура = СтрокаФактуры.ПродукцияФактура;
					НоваяСтрока.Цвет = СтрокаФактуры.ПродукцияЦвет;
					НоваяСтрока.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.МетрКвадратный;
					НоваяСтрока.Количество = ?(СтрокаФактуры.ПродукцияКоличество > 0, СтрокаФактуры.ПродукцияКоличество, СтрокаТовара.Количество);
					НоваяСтрока.ЦенаСебестоимость = РегистрыСведений.ЦеныМатериаловПоставщиков.ПолучитьЦенуМатериала(Отчет.НастройкаПредварительногоРасчета.Поставщик, НоваяСтрока.Фактура, НоваяСтрока.Цвет, ДатаОтчета, Отчет.НастройкаПредварительногоРасчета.ВалютаЗаказа, СтрокаТовара.Номенклатура.ВидНоменклатуры, Отчет.НастройкаПредварительногоРасчета.ВидЦеныПоставщика);
					НоваяСтрока.СуммаСебестоимость = НоваяСтрока.Количество * НоваяСтрока.ЦенаСебестоимость;
					СуммаСебестоимостиПотолка = СуммаСебестоимостиПотолка + НоваяСтрока.СуммаСебестоимость;
				КонецЦикла;
				
				//разобьем потолок - услуги раскроя
				Для Каждого СтрокаУслуг Из СтруктураЗаказ.Услуги Цикл
					НоваяСтрока = ТаблицаСебестоимостиПотолков.Добавить();
					НоваяСтрока.Комната = СтрокаТовара.Комната;
					НоваяСтрока.Потолок = СтрокаТовара.Номенклатура;
					НоваяСтрока.ВидСебестоимости = "Стоимость услуг раскроя по прайсу поставщика";
					НоваяСтрока.Номенклатура = СтрокаУслуг.Номенклатура;
					НоваяСтрока.ЕдиницаИзмерения = СтрокаУслуг.ЕдиницаИзмерения;
					НоваяСтрока.Количество = СтрокаУслуг.Количество;
					НоваяСтрока.ЦенаСебестоимость = СтрокаУслуг.Цена;
					НоваяСтрока.СуммаСебестоимость = СтрокаУслуг.Сумма;
					СуммаСебестоимостиПотолка = СуммаСебестоимостиПотолка + НоваяСтрока.СуммаСебестоимость;
				КонецЦикла;
				
				СтрокаТовара.СуммаСебестоимость = СуммаСебестоимостиПотолка;
				Если НЕ СтрокаТовара.Количество = 0 Тогда
					СтрокаТовара.ЦенаСебестоимость = Окр(СтрокаТовара.СуммаСебестоимость / СтрокаТовара.Количество,2);
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;	
	Иначе
		//СОБСТВЕННОЕ ПРОИЗВОДСТВО
		Для Каждого СтрокаТовара Из ТаблицаТоваров Цикл
			Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(СтрокаТовара.Номенклатура) Тогда
				СтрокаТовара.ЭтоПотолок = Истина;
				//потолок или отрез
				ОписаниеОшибки = "";
				СтруктураПотолок = ОбменСEasyCeiling.ПолучитьСтруктуруПотолка(СтрокаТовара.Номенклатура, Неопределено,,,,,, ОписаниеОшибки);
				Если СтруктураПотолок = Неопределено Тогда
					Продолжить;
				КонецЕсли;	
				Если ЗначениеЗаполнено(ОписаниеОшибки)
					И СтруктураПотолок.Свойство("ПродукцияНоменклатура") 
					И НЕ ЗначениеЗаполнено(СтруктураПотолок.ПродукцияНоменклатура) Тогда
					Продолжить;
				КонецЕсли;
				
				ПодразделениеЗаказа = Справочники.Подразделения.ПустаяСсылка();
				Если ТипЗнч(Отчет.ДокументРозницы) = Тип("ДокументСсылка.ЗаказДоговор") Тогда
					ПодразделениеЗаказа = Отчет.ДокументРозницы.Подразделение;
				КонецЕсли;
				ДанныеЗаказа = ОбменСEasyCeiling.СтруктураДанныхЗаказа(Отчет.ДокументРозницы.Организация, ПодразделениеЗаказа, ,
							  				 Отчет.НастройкаПредварительногоРасчета.ВидЦенПроизводства, Отчет.НастройкаПредварительногоРасчета.ВалютаЗаказа, ДатаОтчета);
				СтруктураЗаказ = ОбменСEasyCeiling.ПолучитьСтруктуруЗаказа(СтруктураПотолок, Перечисления.ВидыЗаказов.ЗаказДоговор, ДанныеЗаказа);		
				//СтруктураЗаказ = ОбменСEasyCeiling.ПолучитьСтруктуруЗаказа(СтруктураПотолок, , Отчет.НастройкаПредварительногоРасчета.ВидЦенПроизводства, Отчет.НастройкаПредварительногоРасчета.ВалютаЗаказа, Отчет.Дата, Перечисления.ВидыЗаказов.ЗаказДоговор);
				
				СуммаСебестоимостиПотолка = 0;
				
				//разобьем потолок - пленка
				Для Каждого СтрокаФактуры Из СтрокаТовара.Номенклатура.Потолок_Фактура Цикл
					НоваяСтрока = ТаблицаСебестоимостиПотолков.Добавить();
					НоваяСтрока.Комната = СтрокаТовара.Комната;
					НоваяСтрока.Потолок = СтрокаТовара.Номенклатура;
					НоваяСтрока.ВидСебестоимости = "Стоимость пленки по прайсу производства";
					НоваяСтрока.Номенклатура = СтрокаФактуры.ПродукцияЦвет.Номенклатура;
					НоваяСтрока.Фактура = СтрокаФактуры.ПродукцияФактура;
					НоваяСтрока.Цвет = СтрокаФактуры.ПродукцияЦвет;
					НоваяСтрока.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.МетрКвадратный;
					НоваяСтрока.Количество = СтрокаФактуры.ПродукцияКоличество;
	
					ПараметрыПродукции = Новый Структура;
					ПараметрыПродукции.Вставить("ВидНоменклатуры", 	СтрокаТовара.Номенклатура.ВидНоменклатуры);
					ПараметрыПродукции.Вставить("Фактура", 			НоваяСтрока.Фактура);
					ПараметрыПродукции.Вставить("ЦветФактуры", 		НоваяСтрока.Цвет);			
					ПараметрыПродукции.Вставить("СФотопечатью", 	Ложь);					
					НоваяСтрока.ЦенаСебестоимость = ЦеныКомпании.ПолучитьЦенуПродукции(ПараметрыПродукции, ДатаОтчета, Отчет.НастройкаПредварительногоРасчета.ВидЦенПроизводства, Отчет.НастройкаПредварительногоРасчета.ВалютаЗаказа);
					
					НоваяСтрока.СуммаСебестоимость = НоваяСтрока.Количество * НоваяСтрока.ЦенаСебестоимость;
					СуммаСебестоимостиПотолка = СуммаСебестоимостиПотолка + НоваяСтрока.СуммаСебестоимость;
				КонецЦикла;
				
				//разобьем потолок - услуги раскроя
				Для Каждого СтрокаУслуг Из СтруктураЗаказ.Услуги Цикл
					НоваяСтрока = ТаблицаСебестоимостиПотолков.Добавить();
					НоваяСтрока.Комната = СтрокаТовара.Комната;
					НоваяСтрока.Потолок = СтрокаТовара.Номенклатура;
					НоваяСтрока.ВидСебестоимости = "Стоимость услуг раскроя по прайсу производства";
					НоваяСтрока.Номенклатура = СтрокаУслуг.Номенклатура;
					НоваяСтрока.ЕдиницаИзмерения = СтрокаУслуг.ЕдиницаИзмерения;
					НоваяСтрока.Количество = СтрокаУслуг.Количество;
					НоваяСтрока.ЦенаСебестоимость = СтрокаУслуг.Цена;
					НоваяСтрока.СуммаСебестоимость = СтрокаУслуг.Сумма;
					СуммаСебестоимостиПотолка = СуммаСебестоимостиПотолка + НоваяСтрока.СуммаСебестоимость;
				КонецЦикла;
				
				//разобьем потолок - товары
				Для Каждого СтрокаУслуг Из СтруктураЗаказ.Товары Цикл
					НоваяСтрока = ТаблицаСебестоимостиПотолков.Добавить();
					НоваяСтрока.Комната = СтрокаТовара.Комната;
					НоваяСтрока.Потолок = СтрокаТовара.Номенклатура;
					НоваяСтрока.ВидСебестоимости = "Стоимость товаров по прайсу производства";
					НоваяСтрока.Номенклатура = СтрокаУслуг.Номенклатура;
					НоваяСтрока.ЕдиницаИзмерения = СтрокаУслуг.ЕдиницаИзмерения;
					НоваяСтрока.Количество = СтрокаУслуг.Количество;
					НоваяСтрока.ЦенаСебестоимость = СтрокаУслуг.Цена;
					НоваяСтрока.СуммаСебестоимость = СтрокаУслуг.Сумма;
					СуммаСебестоимостиПотолка = СуммаСебестоимостиПотолка + НоваяСтрока.СуммаСебестоимость;
				КонецЦикла;
				
				СтрокаТовара.СуммаСебестоимость = СуммаСебестоимостиПотолка;
				Если НЕ СтрокаТовара.Количество = 0 Тогда
					СтрокаТовара.ЦенаСебестоимость = Окр(СтрокаТовара.СуммаСебестоимость / СтрокаТовара.Количество,2);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// себестоимость товаров / услуг / материалов	
	Для Каждого СтрокаТовара Из ТаблицаТоваров Цикл
		Если СтрокаТовара.ЭтоПотолок Тогда
			Продолжить;
		КонецЕсли;
		
		Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(СтрокаТовара.Номенклатура) Тогда
			//#7347
			ПараметрыРасчета = ПараметрыРасчета(Отчет.НастройкаПредварительногоРасчета, "Услуги");
			Если Отчет.НастройкаПредварительногоРасчета.ПравилаОпределенияСебестоимостиУслуг > 0 Тогда
				СтрокаТовара.ЦенаСебестоимость = ПолучитьСебестоимостьНоменклатуры(СтрокаТовара, ДатаОтчета, ПараметрыРасчета,
					Отчет.НастройкаПредварительногоРасчета.ПравилаОпределенияСебестоимостиУслуг-1);					
			КонецЕсли;
			
		Иначе
			Если Не СтрокаТовара.ЭтоМатериал Тогда
				//товар
				ПараметрыРасчета = ПараметрыРасчета(Отчет.НастройкаПредварительногоРасчета, "Товары");
				СтрокаТовара.ЦенаСебестоимость = ПолучитьСебестоимостьНоменклатуры(СтрокаТовара, ДатаОтчета, ПараметрыРасчета, 
					Отчет.НастройкаПредварительногоРасчета.ПравилаОпределенияСебестоимостиТоваров);
				
			Иначе					
				//материал
				ПараметрыРасчета = ПараметрыРасчета(Отчет.НастройкаПредварительногоРасчета, "Материалы");
				СтрокаТовара.ЦенаСебестоимость = ПолучитьСебестоимостьНоменклатуры(СтрокаТовара, ДатаОтчета, ПараметрыРасчета, 
					Отчет.НастройкаПредварительногоРасчета.ПравилаОпределенияСебестоимостиМатериалов);
				
			КонецЕсли;
		КонецЕсли;
		
		СтрокаТовара.СуммаСебестоимость = СтрокаТовара.Количество * СтрокаТовара.ЦенаСебестоимость;
	КонецЦикла;
	
	//пересчитаем прибыль и рентабельность по каждой строке
	Для Каждого СтрокаТовара Из ТаблицаТоваров Цикл
		СтрокаТовара.Прибыль = СтрокаТовара.Сумма - СтрокаТовара.СуммаСебестоимость;
		Если НЕ СтрокаТовара.Сумма = 0 Тогда
			СтрокаТовара.Рентабельность = Окр((СтрокаТовара.Прибыль / СтрокаТовара.Сумма)*100,2);
		КонецЕсли;
	КонецЦикла;
	
	//расчитаем прибыль и рентабельность по комнатам
	ТаблицаКомнат = ТаблицаТоваров.Скопировать();
	ТаблицаКомнат.Свернуть("Комната","Сумма, СуммаСебестоимость, Прибыль");
	ТаблицаКомнат.Колонки.Добавить("Рентабельность", Новый ОписаниеТипов("число"));
	Для Каждого ТекущаяКомната Из ТаблицаКомнат Цикл
		Если НЕ ТекущаяКомната.Сумма = 0 Тогда
			ТекущаяКомната.Рентабельность = Окр((ТекущаяКомната.Прибыль / ТекущаяКомната.Сумма)*100,2);
		КонецЕсли;
	КонецЦикла;
	
	УчитыватьВыработку = Отчет.НастройкаПредварительногоРасчета.УчитыватьВыработку;
	СтоимостьВыработки = 0;
	Если УчитыватьВыработку Тогда
		
		//определим себестоимость монтажа (выработка розницы)
		ТаблицаИсполнителей = Новый ТаблицаЗначений;
		ТаблицаИсполнителей.Колонки.Добавить("Сотрудник");
		ТаблицаИсполнителей.Колонки.Добавить("Коэффициент");
		ТаблицаИсполнителей.Колонки.Добавить("ТарифИсполнителя", Новый ОписаниеТипов("СправочникСсылка.ТарифыИсполнителей"));
		НоваяСтрока = ТаблицаИсполнителей.Добавить();
		НоваяСтрока.Сотрудник = Справочники.Сотрудники.ПустаяСсылка();
		НоваяСтрока.Коэффициент = 1;
		Если ЗначениеЗаполнено(Отчет.НастройкаПредварительногоРасчета.ТарифИсполнителя) Тогда
			НоваяСтрока.ТарифИсполнителя = Отчет.НастройкаПредварительногоРасчета.ТарифИсполнителя;	
		КонецЕсли;
		
		//++ №10184 по лиду выведено в отдельный документ ПредварительныйРасчетЗаказДоговора
		Если ТипЗнч(Отчет.ДокументРозницы) = Тип("ДокументСсылка.Лид") Тогда
			ВременнаяТаблицаМатериалы = ПредварительныйРасчет.Материалы.Выгрузить();
		Иначе
		//-- №10184
			ВременнаяТаблицаМатериалы = Отчет.ДокументРозницы.Материалы.Выгрузить();
		КонецЕсли;
		ВременнаяТаблицаМатериалы.Колонки.Добавить("СерияНоменклатуры");
		
		//++ №10184 по лиду выведено в отдельный документ ПредварительныйРасчетЗаказДоговора
		Если ТипЗнч(Отчет.ДокументРозницы) = Тип("ДокументСсылка.Лид") Тогда
			ВременнаяТаблицаТовары = ПредварительныйРасчет.ТоварыУслуги.Выгрузить();
		Иначе
		//-- №10184
			ВременнаяТаблицаТовары = Отчет.ДокументРозницы.ТоварыУслуги.Выгрузить();
		КонецЕсли;
		ВременнаяТаблицаТовары.Колонки.Добавить("СерияНоменклатуры");
		
		ВидСкидки = Справочники.ВидыСкидок.ПустаяСсылка();
		Контрагент = Справочники.Контрагенты.ПустаяСсылка();
		Организация = Отчет.ДокументРозницы.Организация; // №13443
		
		Если ТипЗнч(Отчет.ДокументРозницы) = Тип("ДокументСсылка.Лид") Тогда
			ВидСкидки = ПредварительныйРасчет.ВидСкидки; //#7796
			Организация = ПредварительныйРасчет; // №13443
		ИначеЕсли ТипЗнч(Отчет.ДокументРозницы) = Тип("ДокументСсылка.ПредварительныйРасчетЗаказДоговора") Тогда
			ВидСкидки = Отчет.ДокументРозницы.ВидСкидки;
		Иначе
			Контрагент = Отчет.ДокументРозницы.Контрагент;
			ВидСкидки = Отчет.ДокументРозницы.ВидСкидки;
		КонецЕсли;	
		
		//++ №10184 основание для выработки
		ОснованиеВыработки = Отчет.ДокументРозницы;
		
		// для предварительного расчета это Лид
		Если ТипЗнч(Отчет.ДокументРозницы) = Тип("ДокументСсылка.ПредварительныйРасчетЗаказДоговора") Тогда
			ОснованиеВыработки = Отчет.ДокументРозницы.Основание;
		КонецЕсли;
		//-- №10184
			
		//#6347 изменена логика расчета выработки 
		СтруктураМонтаж = Зарплата.ПолучитьСтруктуруВидаМонтажДляРасчетаВыработки(ДатаОтчета, 
										Организация, Контрагент, // №13443 было: Отчет.ДокументРозницы.Организация, Контрагент,
										Отчет.ДокументРозницы.Автор, ОснованиеВыработки,
										Справочники.Сотрудники.ПустаяСсылка(), 
										Отчет.НастройкаПредварительногоРасчета.ВидМонтажнойБригады, 
										ТаблицаИсполнителей, 
										Отчет.НастройкаПредварительногоРасчета.СкладТоваровМонтажа,
										ВременнаяТаблицаТовары,
										ВременнаяТаблицаМатериалы,
										ВидСкидки,
										Отчет.НастройкаПредварительногоРасчета.ВалютаЗаказа, 
										Отчет.НастройкаПредварительногоРасчета.СпособРаспределенияВыработкиПоМонтажникам,
										Отчет.НастройкаПредварительногоРасчета.ВидОперацииМонтажа);
		//ТаблицаПоВыработке = Зарплата.ПолучитьЗаписиРегистраВыработки(СтруктураМонтаж);
		
		// выработка складывается из
		// 1. выработки по лиду
		// 2. выработки по предполагаемому монтажу
		ТаблицаВыработкиЛид = Неопределено;
		Если ТипЗнч(Отчет.ДокументРозницы) = Тип("ДокументСсылка.Лид")
			ИЛИ ТипЗнч(Отчет.ДокументРозницы) = Тип("ДокументСсылка.ПредварительныйРасчетЗаказДоговора") // №10184
		Тогда
			НаборЗаписей = РегистрыНакопления.ВыработкаИсполнителейРозницы.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ОснованиеВыработки); // №10184, ранее было: Отчет.ДокументРозницы);
			НаборЗаписей.Прочитать();
			ТаблицаВыработкиЛид = НаборЗаписей.Выгрузить();
		ИначеЕсли ТипЗнч(Отчет.ДокументРозницы) = Тип("ДокументСсылка.ЗаказДоговор") И ТипЗнч(Отчет.ДокументРозницы.Основание) = Тип("ДокументСсылка.Лид") И ЗначениеЗаполнено(Отчет.ДокументРозницы.Основание) Тогда
			НаборЗаписей = РегистрыНакопления.ВыработкаИсполнителейРозницы.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(Отчет.ДокументРозницы.Основание);
			НаборЗаписей.Прочитать();
			ТаблицаВыработкиЛид = НаборЗаписей.Выгрузить();
		КонецЕсли;
		
		ТаблицаПоВыработке = Зарплата.РассчитатьВыработкуПоДокументу(СтруктураМонтаж);		
		Если НЕ ТаблицаВыработкиЛид = Неопределено Тогда
			Для каждого СтрокаВыработкиЛид из ТаблицаВыработкиЛид Цикл
				НоваяСтрока = ТаблицаПоВыработке.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаВыработкиЛид);
			КонецЦикла;
		КонецЕсли;
		
		СтоимостьВыработки = ТаблицаПоВыработке.Итог("Стоимость");
				
	КонецЕсли;
	
	Таб = Новый ТабличныйДокумент;
	Таб.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОтчетПредварительнаяСебестоимостьЗаказДоговора";
	
	Макет = Отчеты.ПредварительнаяСебестоимостьЗаказДоговора.ПолучитьМакет("Макет");
	
	Таб.НачатьАвтогруппировкуСтрок();
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаОтчета");
	ОбластьМакета.Параметры.ЗаказДоговор = Отчет.ДокументРозницы;
	ОбластьМакета.Параметры.ДатаОтчета = Формат(Отчет.Дата,"ДЛФ=Д");
	Таб.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
	Таб.Вывести(ОбластьМакета);
	
	Для Каждого ТекущаяКомната Из ТаблицаКомнат Цикл
		ОбластьМакета = Макет.ПолучитьОбласть("Строка_Комната");
		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ТекущаяКомната);
		Таб.Вывести(ОбластьМакета,1,"Комната",Истина);
		
		Для Каждого ТекущийТовар Из ТаблицаТоваров Цикл
			Если ТекущийТовар.Комната = ТекущаяКомната.Комната Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("Строка_Номенклатура");
				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ТекущийТовар);
				Таб.Вывести(ОбластьМакета,2,"Номенклатура",Истина);
				
				Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураПотолкаИлиОтреза(ТекущийТовар.Номенклатура) Тогда
					Для Каждого ТекущаяПозицияПотолка Из ТаблицаСебестоимостиПотолков Цикл
						Если ТекущаяПозицияПотолка.Комната = ТекущийТовар.Комната И
							ТекущаяПозицияПотолка.Потолок = ТекущийТовар.Номенклатура Тогда
								ОбластьМакета = Макет.ПолучитьОбласть("Строка_ПозицияВПотолке");
								ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ТекущаяПозицияПотолка);
								Таб.Вывести(ОбластьМакета,3,"ПозицияПотолка",Ложь);
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	Таб.ЗакончитьАвтогруппировкуСтрок();
	
	Если УчитыватьВыработку Тогда
		//выведем таблицу по выработке
		ОбластьМакета = Макет.ПолучитьОбласть("Выработка_ШапкаТаблицы");
		Таб.Вывести(ОбластьМакета);
		Для Каждого СтрокаВыработки Из ТаблицаПоВыработке Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("Выработка_Строка");
			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, СтрокаВыработки);
			Таб.Вывести(ОбластьМакета);
		КонецЦикла;
		ОбластьМакета = Макет.ПолучитьОбласть("Выработка_Итого");
		ОбластьМакета.Параметры.Стоимость = ТаблицаПоВыработке.Итог("Стоимость");
		Таб.Вывести(ОбластьМакета);
	КонецЕсли;

	//выведем итоговую таблицу
	ОбластьМакета = Макет.ПолучитьОбласть(?(УчитыватьВыработку, "ОбщиеИтоги", "ОбщиеИтогиБезВыработки"));
	СтруктураИтогов = Новый Структура("СуммаДокумента, СебестоимостьТоваров, СтоимостьВыработки, СебестоимостьВсего, Прибыль, Рентабельность");
	
	//++ №10184 по лиду выведено в отдельный документ ПредварительныйРасчетЗаказДоговора
	Если ТипЗнч(Отчет.ДокументРозницы) = Тип("ДокументСсылка.Лид") Тогда
		СтруктураИтогов.СуммаДокумента = ПредварительныйРасчет.СуммаДокумента;
	Иначе
	//-- №10184
		СтруктураИтогов.СуммаДокумента = Отчет.ДокументРозницы.СуммаДокумента;
	КонецЕсли;
	
	СтруктураИтогов.СебестоимостьТоваров = ТаблицаКомнат.Итог("СуммаСебестоимость");
	СтруктураИтогов.СтоимостьВыработки = СтоимостьВыработки;
	СтруктураИтогов.СебестоимостьВсего = СтоимостьВыработки + ТаблицаКомнат.Итог("СуммаСебестоимость");
	СтруктураИтогов.Прибыль = СтруктураИтогов.СуммаДокумента - (СтоимостьВыработки + ТаблицаКомнат.Итог("СуммаСебестоимость"));
	Если НЕ СтруктураИтогов.СуммаДокумента = 0 Тогда
		СтруктураИтогов.Рентабельность = Окр(((СтруктураИтогов.СуммаДокумента - (СтоимостьВыработки + ТаблицаКомнат.Итог("СуммаСебестоимость"))) / СтруктураИтогов.СуммаДокумента)*100,2);
	КонецЕсли;
	ОбластьМакета.Параметры.Заполнить(СтруктураИтогов);
	Таб.Вывести(ОбластьМакета);
	
	Возврат Таб;
	
КонецФункции

#КонецОбласти

#Область ВспомогательныеПроцедурыФункции

&НаСервереБезКонтекста
Функция ПараметрыРасчета(НастройкаПредварительногоРасчета, ВидНоменклатурыСтрокой)
	
	ПараметрыРасчета = Новый Структура;
	ПараметрыРасчета.Вставить("ВалютаЗаказа", НастройкаПредварительногоРасчета.ВалютаЗаказа);
	
	Если ВидНоменклатурыСтрокой = "Товары" Тогда
		ПараметрыРасчета.Вставить("ВидЦены", НастройкаПредварительногоРасчета.ВидЦенТовары);
		ПараметрыРасчета.Вставить("Поставщик", НастройкаПредварительногоРасчета.ПоставщикТоваров); 
		ПараметрыРасчета.Вставить("ВидЦеныПоставщика", НастройкаПредварительногоРасчета.ВидЦеныПоставщикаТоваров);		
		ПараметрыРасчета.Вставить("УчитыватьОприходование", НастройкаПредварительногоРасчета.УчитыватьОприходованиеТоваров);
		ПараметрыРасчета.Вставить("КоличествоМесяцев", НастройкаПредварительногоРасчета.ТоварыКоличествоАнализируемыхМесяцев);
		
	ИначеЕсли ВидНоменклатурыСтрокой = "Услуги" Тогда
		ПараметрыРасчета.Вставить("ВидЦены", НастройкаПредварительногоРасчета.ВидЦенУслуги);
		ПараметрыРасчета.Вставить("Поставщик", НастройкаПредварительногоРасчета.ПоставщикУслуг); 
		ПараметрыРасчета.Вставить("ВидЦеныПоставщика", НастройкаПредварительногоРасчета.ВидЦеныПоставщикаУслуг);		
		ПараметрыРасчета.Вставить("УчитыватьОприходование", НастройкаПредварительногоРасчета.УчитыватьОприходованиеУслуг);
		ПараметрыРасчета.Вставить("КоличествоМесяцев", НастройкаПредварительногоРасчета.УслугиКоличествоАнализируемыхМесяцев);
		
	ИначеЕсли ВидНоменклатурыСтрокой = "Материалы" Тогда
		ПараметрыРасчета.Вставить("ВидЦены", НастройкаПредварительногоРасчета.ВидЦенМатериалы);
		ПараметрыРасчета.Вставить("Поставщик", НастройкаПредварительногоРасчета.ПоставщикМатериалов); 
		ПараметрыРасчета.Вставить("ВидЦеныПоставщика", НастройкаПредварительногоРасчета.ВидЦеныПоставщикаМатериалов);		
		ПараметрыРасчета.Вставить("УчитыватьОприходование", НастройкаПредварительногоРасчета.УчитыватьОприходованиеМатериалов);
		ПараметрыРасчета.Вставить("КоличествоМесяцев", НастройкаПредварительногоРасчета.МатериалыКоличествоАнализируемыхМесяцев);
		
	КонецЕсли;
	
	Возврат ПараметрыРасчета;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСебестоимостьНоменклатуры(ДанныеНоменклатуры, Дата, ПараметрыРасчета, ПравилаОпределенияСебестоимости)
					
	ЦенаСебестоимость = 0 ;
	Если ПравилаОпределенияСебестоимости = 0 Тогда
		// по ценам компании
		ЦенаСебестоимость = РегистрыСведений.ЦеныНоменклатуры.ПолучитьЦенуНоменклатурыВВалюте(Дата, ПараметрыРасчета.ВидЦены, ДанныеНоменклатуры.Номенклатура, ДанныеНоменклатуры.ХарактеристикаНоменклатуры, ДанныеНоменклатуры.ЕдиницаИзмерения, ПараметрыРасчета.ВалютаЗаказа);
	ИначеЕсли ПравилаОпределенияСебестоимости = 1 Тогда
		//по ценам поставщика
		ЦенаСебестоимость = РегистрыСведений.ЦеныПоставщиков.ПолучитьЦенуНоменклатурыВВалюте(Дата, ПараметрыРасчета.Поставщик, ДанныеНоменклатуры.Номенклатура, ДанныеНоменклатуры.ХарактеристикаНоменклатуры, ДанныеНоменклатуры.ЕдиницаИзмерения, ПараметрыРасчета.ВалютаЗаказа, ПараметрыРасчета.ВидЦеныПоставщика);
	ИначеЕсли ПравилаОпределенияСебестоимости = 2 Тогда
		//по последней цене приобретения
		ЦенаСебестоимость = ПолучитьЦенуПоследнегоПоступления(Дата, ДанныеНоменклатуры.Номенклатура, ДанныеНоменклатуры.ХарактеристикаНоменклатуры, ДанныеНоменклатуры.ЕдиницаИзмерения, ПараметрыРасчета.ВалютаЗаказа);
	ИначеЕсли ПравилаОпределенияСебестоимости = 3 Тогда
		//по средней цене приобретения
	    ЦенаСебестоимость = ПолучитьСреднююЦенуПоступления(Дата, ДанныеНоменклатуры.Номенклатура, ДанныеНоменклатуры.ХарактеристикаНоменклатуры, ДанныеНоменклатуры.ЕдиницаИзмерения, ПараметрыРасчета.ВалютаЗаказа, ПараметрыРасчета.УчитыватьОприходование, ПараметрыРасчета.КоличествоМесяцев)
	
	КонецЕсли;
			
	Возврат ЦенаСебестоимость;

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЦенуПоследнегоПоступления(Дата, Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, Валюта)
	
	УстановитьПривилегированныйРежим(Истина);
	Цена = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Закупки.Ссылка.Дата КАК Период,
	|	Закупки.Номенклатура КАК Номенклатура,
	|	Закупки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВЫБОР
	|		КОГДА Закупки.Количество <> 0
	|			ТОГДА Закупки.Сумма / Закупки.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.ПоступлениеТоваровИУслуг.Товары КАК Закупки
	|ГДЕ
	|	Закупки.Ссылка.Дата <= &Дата
	|	И Закупки.Ссылка.Валюта = &Валюта
	|	И Закупки.Номенклатура = &Номенклатура
	|	И Закупки.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
	|	И Закупки.ЕдиницаИзмерения = &ЕдиницаИзмерения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Закупки.Ссылка.Дата,
	|	Закупки.Номенклатура,
	|	НЕОПРЕДЕЛЕНО,
	|	ВЫБОР
	|		КОГДА Закупки.Количество <> 0
	|			ТОГДА Закупки.Сумма / Закупки.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	Документ.ПоступлениеТоваровИУслуг.Услуги КАК Закупки
	|ГДЕ
	|	Закупки.Ссылка.Проведен
	|	И Закупки.Ссылка.Дата <= &Дата
	|	И Закупки.Ссылка.Валюта = &Валюта
	|	И Закупки.Номенклатура = &Номенклатура
	|	И Закупки.ЕдиницаИзмерения = &ЕдиницаИзмерения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ВТ.Период КАК Период,
	|	ВТ.Номенклатура КАК Номенклатура,
	|	ВТ.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ.Цена КАК Цена
	|ИЗ
	|	ВТ КАК ВТ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ.Период УБЫВ";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Валюта", Валюта);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", ХарактеристикаНоменклатуры);
	Запрос.УстановитьПараметр("ЕдиницаИзмерения", ЕдиницаИзмерения);	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Цена = Выборка.Цена;	
	КонецЕсли;
	
	Возврат Цена;
	
КонецФункции	

&НаСервереБезКонтекста
Функция ПолучитьСреднююЦенуПоступления(Дата, Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, Валюта, УчитыватьОприходование, КоличествоМесяцев)
	
	УстановитьПривилегированныйРежим(Истина);
	Цена = 0;
	
	ДатаНачала = ДобавитьМесяц(Дата, -КоличествоМесяцев);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Закупки.Номенклатура КАК Номенклатура,
	|	Закупки.Количество КАК Количество,
	|	ВЫБОР
	|		КОГДА Закупки.Количество <> 0
	|			ТОГДА Закупки.Сумма / Закупки.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Цена
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.ПоступлениеТоваровИУслуг.Товары КАК Закупки
	|ГДЕ
	|	Закупки.Ссылка.Дата >= &ДатаНачала
	|	И Закупки.Ссылка.Дата <= &Дата
	|	И Закупки.Ссылка.Проведен
	|	И Закупки.Ссылка.Валюта = &Валюта
	|	И Закупки.Номенклатура = &Номенклатура
	|	И Закупки.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
	|	И Закупки.ЕдиницаИзмерения = &ЕдиницаИзмерения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Закупки.Номенклатура,
	|	Закупки.Количество,
	|	ВЫБОР
	|		КОГДА Закупки.Количество <> 0
	|			ТОГДА Закупки.Сумма / Закупки.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	Документ.ПоступлениеТоваровИУслуг.Услуги КАК Закупки
	|ГДЕ
	|	Закупки.Ссылка.Дата >= &ДатаНачала
	|	И Закупки.Ссылка.Дата <= &Дата
	|	И Закупки.Ссылка.Проведен
	|	И Закупки.Ссылка.Валюта = &Валюта
	|	И Закупки.Номенклатура = &Номенклатура
	|	И Закупки.ЕдиницаИзмерения = &ЕдиницаИзмерения
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Закупки.Номенклатура,
	|	Закупки.Количество,
	|	ВЫБОР
	|		КОГДА Закупки.Количество <> 0
	|			ТОГДА Закупки.Сумма / Закупки.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	Документ.ОприходованиеТоваров.Товары КАК Закупки
	|ГДЕ
	|	&УчитыватьОприходование
	|	И Закупки.Ссылка.Дата >= &ДатаНачала
	|	И Закупки.Ссылка.Дата <= &Дата
	|	И Закупки.Ссылка.Проведен
	|	И Закупки.Ссылка.Валюта = &Валюта
	|	И Закупки.Номенклатура = &Номенклатура
	|	И Закупки.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
	|	И Закупки.ЕдиницаИзмерения = &ЕдиницаИзмерения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ.Номенклатура КАК Номенклатура,
	|	ВЫРАЗИТЬ(СУММА(ВТ.Количество * ВТ.Цена) / СУММА(ВТ.Количество) КАК ЧИСЛО(15, 2)) КАК Цена
	|ИЗ
	|	ВТ КАК ВТ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.Номенклатура";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Валюта", Валюта);
	Запрос.УстановитьПараметр("УчитыватьОприходование", УчитыватьОприходование);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", ХарактеристикаНоменклатуры);
	Запрос.УстановитьПараметр("ЕдиницаИзмерения", ЕдиницаИзмерения);	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Цена = Выборка.Цена;	
	КонецЕсли;
	
	Возврат Цена;
	
КонецФункции	

#КонецОбласти
